readme.md
```mermaid
erDiagram
    USER ||--|| ADMIN : manages
    USER {
        int id
        String username
        String email
        String password
        String role
        String profileImage
    }

    ANIMAL ||--o| FAMILY : belongs_to
    ANIMAL {
        int id
        String name
        String type
        String gender
        String countryOfOrigin
        LocalDate dateOfEntry
        String imageUrl
    }

    FAMILY {
        int id
        String familyName
        String description
    }

    FAMILY ||--o{ ANIMAL : includes
```
